caAERS/software/jbi/caaers2adeers-sync/core-camel-su/src/test/resources/xslt/test2.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  Copyright SemanticBits, Northwestern University and Akaza Research
  
  Distributed under the OSI-approved BSD 3-Clause License.
  See http://ncip.github.com/caaers/LICENSE.txt for details.
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <stud:createStudy xmlns:stud="http://schema.integration.caaers.cabig.nci.nih.gov/study">
            <stud:studies>
                <stud:study>
                    <shortTitle>A Randomized Phase III Trial Comparing a Neoadjuvant Regimen of FEC-75 Followed by
                        Paclitaxel
                        Plus Trastuzumab with a Neoadjuvant Regimen of Paclitaxel Plus Trastuzumab Followed by FEC-75
                        Plus Trastuzumab in Patients with HER-2 Positive Operable Breast Cancer
                    </shortTitle>
                    <phaseCode>Phase III Trial</phaseCode>
                    <verbatimFirst>true</verbatimFirst>
                    <adeersReporting>true</adeersReporting>
                    <studyPurpose>Treatment</studyPurpose>
                    <aeTermUnique>true</aeTermUnique>
                    <stud:aeTerminology>
                        <stud:ctcVersion>
                            <name>4</name>
                        </stud:ctcVersion>
                    </stud:aeTerminology>
                    <stud:diseaseTerminology>
                        <diseaseCodeTerm>CTEP</diseaseCodeTerm>
                    </stud:diseaseTerminology>
                    <fundingSponsor>
                        <organizationAssignedIdentifier>
                            <value>ACOSOG-Z1041</value>
                        </organizationAssignedIdentifier>
                        <stud:studyFundingSponsor>
                            <stud:organization>
                                <name>Cancer Therapy Evaluation Program</name>
                                <nciInstituteCode>CTEP</nciInstituteCode>
                            </stud:organization>
                        </stud:studyFundingSponsor>
                    </fundingSponsor>
                    <coordinatingCenter>
                        <organizationAssignedIdentifier>
                            <value>ACOSOG-Z1041</value>
                        </organizationAssignedIdentifier>
                        <stud:studyCoordinatingCenter>
                            <stud:organization>
                                <name>American College of Surgeons Oncology Trials Group</name>
                                <nciInstituteCode>ACOSOG</nciInstituteCode>
                                <type>CGP</type>
                            </stud:organization>
                        </stud:studyCoordinatingCenter>
                    </coordinatingCenter>
                    <identifiers>
                        <stud:systemAssignedIdentifier>
                            <type>Other</type>
                            <value>ACOSOG-Z1041</value>
                            <primaryIndicator>false</primaryIndicator>
                            <systemName>CTEP-ESYS</systemName>
                        </stud:systemAssignedIdentifier>
                    </identifiers>
                    <treatmentAssignments>
                        <stud:treatmentAssignment>
                            <ctepDbIdentifier>14250</ctepDbIdentifier>
                            <code>ARM 1</code>
                            <description>Chemotherapy Regimen - (FEC)
                                Cycle = 21 days: (Max = 4 cycles)
                                5-FU: 500mg/m2 IVP on day 1
                                Epirubicin: 75mg/m2 IV over 15 min on day 1
                                Cyclophosphamide: 500mg/m2 IV over 30 min on day 1

                                21 days after last dose of FEC:
                                Cycle = 12 weeks:
                                Paclitaxel: 80mg/m2 IV over 60 min weekly
                                Trastuzumab: 4mg/kg IV over 90 min week 1, then 2mg/kg IV over 30 min for remaining 11
                                weeks

                                3-4 wks after last preop dose of Trastuzumab, begin
                                Cycle = 3 weeks:
                                Trastuzumab: 6mg/kg IV over 60 min
                                (Continue until 52 wks from first preop dose reached)
                            </description>
                        </stud:treatmentAssignment>
                        <stud:treatmentAssignment>
                            <ctepDbIdentifier>14251</ctepDbIdentifier>
                            <code>ARM 2</code>
                            <description>Chemotherapy Regimen - (FEC)
                                Cycle = 12 weeks:
                                Paclitaxel: 80mg/m2 IV over 60 min weekly
                                Trastuzumab: 4mg/kg IV over 90 min week 1, then 2mg/kg IV over 30 min during subsequent
                                12 weeks

                                14 days after last dose Paclitaxel, begin FEC + Trastuzumab -
                                Cycle = 21 days: (Max = 4 cycles)
                                5-FU: 500mg/m2 IVP on day 1
                                Epirubicin: 75mg/m2 IV over 15 min on day 1
                                Cyclophosphamide: 500mg/m2 IV over 30 min on day 1
                                Trastuzumab: 2mg/kg IV over 30 min weekly x 12 weeks.

                                3-4 weeks after last preop dose of Trastuzumab, begin
                                Cycle = 3 weeks:
                                Trastuzumab: 6mg/kg IV over 60 min
                                (Continue until 52 wks from first preop dose)
                            </description>
                        </stud:treatmentAssignment>
                    </treatmentAssignments>
                    <studyAgents>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>26271</nscNumber>
                                <name>Cyclophosphamide</name>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>true</partOfLeadIND>
                            <studyAgentINDAssociations>
                                <stud:studyAgentINDAssociation>
                                    <stud:investigationalNewDrug>
                                        <indNumber>6667</indNumber>
                                        <holderName>CTEP</holderName>
                                    </stud:investigationalNewDrug>
                                </stud:studyAgentINDAssociation>
                            </studyAgentINDAssociations>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>256942</nscNumber>
                                <name>Epirubicin (Ellence)</name>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>true</partOfLeadIND>
                            <studyAgentINDAssociations>
                                <stud:studyAgentINDAssociation>
                                    <stud:investigationalNewDrug>
                                        <indNumber>6667</indNumber>
                                        <holderName>CTEP</holderName>
                                    </stud:investigationalNewDrug>
                                </stud:studyAgentINDAssociation>
                            </studyAgentINDAssociations>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>19893</nscNumber>
                                <name>5-Fluorouracil (5-FU)</name>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>true</partOfLeadIND>
                            <studyAgentINDAssociations>
                                <stud:studyAgentINDAssociation>
                                    <stud:investigationalNewDrug>
                                        <indNumber>6667</indNumber>
                                        <holderName>CTEP</holderName>
                                    </stud:investigationalNewDrug>
                                </stud:studyAgentINDAssociation>
                            </studyAgentINDAssociations>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>673089</nscNumber>
                                <name>Paclitaxel (Taxol)</name>
                            </stud:agent>
                            <indType>NA_COMMERCIAL</indType>
                            <partOfLeadIND>true</partOfLeadIND>
                            <studyAgentINDAssociations>
                                <stud:studyAgentINDAssociation>
                                    <stud:investigationalNewDrug>
                                        <indNumber>6667</indNumber>
                                        <holderName>CTEP</holderName>
                                    </stud:investigationalNewDrug>
                                </stud:studyAgentINDAssociation>
                            </studyAgentINDAssociations>
                        </stud:studyAgent>
                        <stud:studyAgent>
                            <stud:agent>
                                <nscNumber>688097</nscNumber>
                                <name>Trastuzumab (Herceptin)</name>
                            </stud:agent>
                            <indType>OTHER</indType>
                            <partOfLeadIND>true</partOfLeadIND>
                            <studyAgentINDAssociations>
                                <stud:studyAgentINDAssociation>
                                    <stud:investigationalNewDrug>
                                        <indNumber>6667</indNumber>
                                        <holderName>CTEP</holderName>
                                    </stud:investigationalNewDrug>
                                </stud:studyAgentINDAssociation>
                            </studyAgentINDAssociations>
                        </stud:studyAgent>
                    </studyAgents>
                    <studyDevices/>
                    <otherInterventions>
                        <stud:otherIntervention>
                            <interventionType>SURGERY</interventionType>
                            <name>Surgery</name>
                        </stud:otherIntervention>
                    </otherInterventions>
                    <ctepStudyDiseases>
                        <stud:ctepStudyDisease>
                            <stud:diseaseTerm>
                                <term>Invasive breast carcinoma</term>
                                <meddraCode>10006190</meddraCode>
                            </stud:diseaseTerm>
                            <leadDisease>true</leadDisease>
                        </stud:ctepStudyDisease>
                    </ctepStudyDiseases>
                </stud:study>
            </stud:studies>
        </stud:createStudy>
    </soapenv:Body>
</soapenv:Envelope>
